#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-6EjqXXKgSeXTauKm

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
digitalocean_ssh_key.secondary: Refreshing state... [id=38557683]
digitalocean_ssh_key.m2: Refreshing state... [id=38210829]
digitalocean_droplet.postgres: Refreshing state... [id=359948759]
digitalocean_project.blackboards: Refreshing state... [id=d006b183-c896-4d41-a341-fb46d729eeb6]
aws_key_pair.main: Refreshing state... [id=macbook-m2-pro]
aws_iam_user.configuration_deployer: Refreshing state... [id=configuration.deployer]
module.postgres.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
module.remote_state.aws_s3_bucket.this: Refreshing state... [id=terraform-remote-state-m3rc9k]
aws_vpc.main: Refreshing state... [id=vpc-0d1ab7c53aec22955]
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
aws_route53_zone.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0]
aws_iam_user.github_actions: Refreshing state... [id=github.actions]
module.postgres.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
aws_iam_user.personal: Refreshing state... [id=alex.jackson]
aws_iam_user.postgres_backups: Refreshing state... [id=postgres.backups]
module.f2_instance.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
module.f2_instance.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
module.postgres_backups.aws_s3_bucket.this: Refreshing state... [id=postgres-backups-tr1pjq]
module.configuration_bucket.aws_s3_bucket.this: Refreshing state... [id=configuration-sfvz2s]
aws_iam_access_key.postgres_backups: Refreshing state... [id=AKIAYEHTA3LZFDVAEC42]
module.postgres.aws_iam_role.this: Refreshing state... [id=postgres-role]
aws_iam_access_key.configuration_deployer: Refreshing state... [id=AKIAYEHTA3LZKXOXWTYC]
module.f2_instance.aws_iam_role.this: Refreshing state... [id=main-role]
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
aws_iam_user_login_profile.personal: Refreshing state... [id=alex.jackson]
aws_iam_access_key.personal: Refreshing state... [id=AKIAYEHTA3LZCH5CBE4Y]
aws_iam_access_key.github_actions: Refreshing state... [id=AKIAYEHTA3LZK6JIHCYE]
module.postgres.aws_iam_instance_profile.this: Refreshing state... [id=postgres-instance-profile]
module.f2_instance.aws_iam_instance_profile.this: Refreshing state... [id=main-instance-profile]
aws_iam_user_policy.github_actions: Refreshing state... [id=github.actions:github.actions.policy]
aws_iam_user_policy.personal: Refreshing state... [id=alex.jackson:alex.jackson.policy]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]
aws_subnet.main: Refreshing state... [id=subnet-07936cc0e5c7d83b1]
aws_internet_gateway.main: Refreshing state... [id=igw-0aa2c09bec52493fc]
aws_route53_zone.internal: Refreshing state... [id=Z0474418KLUF1M8YKY2A]
module.postgres.aws_security_group.this: Refreshing state... [id=sg-007170e1e0d4b37a3]
module.f2_instance.aws_security_group.this: Refreshing state... [id=sg-084f10e5da8977ef8]
module.f2_instance.data.aws_subnet.self: Refreshing...
module.postgres.data.aws_subnet.self: Refreshing...
aws_route_table.gateway: Refreshing state... [id=rtb-0881a403738fea9c7]
module.f2_instance.data.aws_subnet.self: Refresh complete after 0s [id=subnet-07936cc0e5c7d83b1]
module.postgres.data.aws_subnet.self: Refresh complete after 0s [id=subnet-07936cc0e5c7d83b1]
module.postgres.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-2551868066]
module.postgres.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-596259391]
module.postgres.aws_security_group_rule.allow_inbound_postgres: Refreshing state... [id=sgrule-1362233703]
module.postgres.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-3052576158]
module.postgres.aws_instance.this: Refreshing state... [id=i-0e295e7dedcd34755]
module.f2_instance.aws_instance.this: Refreshing state... [id=i-0bdb939a052debb4b]
module.f2_instance.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-1085682246]
module.f2_instance.aws_security_group_rule.allow_outbound_subnet_postgres: Refreshing state... [id=sgrule-934331843]
module.f2_instance.aws_security_group_rule.allow_inbound_https: Refreshing state... [id=sgrule-1153391225]
module.f2_instance.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-2409512323]
module.f2_instance.aws_security_group_rule.allow_outbound_postgres: Refreshing state... [id=sgrule-4081642417]
module.f2_instance.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-2980093754]
module.remote_state.aws_s3_bucket_versioning.this: Refreshing state... [id=terraform-remote-state-m3rc9k]
aws_route_table_association.gateway: Refreshing state... [id=rtbassoc-041dbac3ebba9c5ca]
module.postgres_backups.aws_s3_bucket_versioning.this: Refreshing state... [id=postgres-backups-tr1pjq]
module.configuration_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=configuration-sfvz2s]
aws_iam_user_policy.postgres_backups: Refreshing state... [id=postgres.backups:postgres.backups.policy]
aws_iam_user_policy.configuration_deployer: Refreshing state... [id=configuration.deployer:configuration.deployer.policy]
module.postgres.aws_security_group_rule.allow_inbound_connections_from_instances["sg-084f10e5da8977ef8"]: Refreshing state... [id=sgrule-4147220582]
module.postgres.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/postgres-policy]
module.f2_instance.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/main-policy]
module.postgres.aws_iam_role_policy_attachment.this: Refreshing state... [id=postgres-role-20230829203241003500000001]
module.f2_instance.aws_iam_role_policy_attachment.this: Refreshing state... [id=main-role-20230829053104189100000001]
module.postgres.aws_eip.this: Refreshing state... [id=eipalloc-0a20bfd06efbf7f25]
aws_route53_record.internal_postgres: Refreshing state... [id=Z0474418KLUF1M8YKY2A_postgres_CNAME]
module.f2_instance.aws_eip.this: Refreshing state... [id=eipalloc-0e2eced5b3f96fdd0]
aws_route53_record.postgres: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_postgres_A]
aws_route53_record.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0__A]
module.postgres.aws_instance.this: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.f2_instance.aws_security_group_rule.allow_outbound_ssh will be created
  + resource "aws_security_group_rule" "allow_outbound_ssh" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow outbound SSH to anywhere"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-084f10e5da8977ef8"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "egress"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>